Locked-Inc/STAR/star-esp32-firmware/lib/star_bus/src/star_bus_config.c
/* lib/star_bus/src/star_bus_config.c */

/* DHT22 is a bus protocol (single-wire proprietary), similar to I2C/SPI.
 * These methods create bus configurations, not sensor drivers.
 * This is intentional and follows the same pattern as create_i2c(), create_spi(). */

#include "star_bus_config.h"

#include "star_bus_adc.h"
#include "star_bus_gpio.h"
#include "star_bus_i2c.h"
#include "star_bus_onewire.h"
#include "star_bus_spi.h"
#include "star_bus_spi_peripheral.h"
/* Include manager types to access manager struct for SPI host tracking */
#include "driver/spi_slave.h"
#include "esp_adc/adc_cali.h"
#include "esp_adc/adc_cali_scheme.h"
#include "esp_adc/adc_oneshot.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"

#include <inttypes.h>
#include <stdlib.h>
#include <string.h>

#include "esp_check.h"
#include "esp_log.h"
#include "star_bus_manager_types.h"

/* --- Constants --- */

static const char* s_TAG = "STAR_BUS_CONFIG";

/* --- Private Function Prototypes --- */

static void internal_star_bus_config_cleanup(star_bus_config_t* config);

static star_bus_config_t* internal_star_bus_config_create_common(const char*     name,
                                                                 star_bus_type_t type);

/* --- Public Functions --- */

star_bus_config_t* star_bus_config_create_i2c(const char* name,
                                              i2c_port_t  port,
                                              uint8_t     address,
                                              gpio_num_t  sda_pin,
                                              gpio_num_t  scl_pin,
                                              uint32_t    clk_speed)
{
  star_bus_config_t* config = internal_star_bus_config_create_common(name, k_star_bus_type_i2c);
  ESP_RETURN_ON_FALSE(config,
                      NULL,
                      s_TAG,
                      "Failed to create common config for %s",
                      name ? name : "NULL");

  /* Configure I2C-specific parameters */
  config->proto.i2c.port    = port;
  config->proto.i2c.address = address;

  /* Initialize with default I2C configuration */
  memset(&config->proto.i2c.config, 0, sizeof(i2c_config_t));
  config->proto.i2c.config.mode             = I2C_MODE_MASTER;
  config->proto.i2c.config.sda_io_num       = sda_pin;
  config->proto.i2c.config.scl_io_num       = scl_pin;
  config->proto.i2c.config.sda_pullup_en    = GPIO_PULLUP_ENABLE; /* Common practice */
  config->proto.i2c.config.scl_pullup_en    = GPIO_PULLUP_ENABLE; /* Common practice */
  config->proto.i2c.config.master.clk_speed = clk_speed;

  /* Initialize default operations */
  star_bus_i2c_init_default_ops(&config->proto.i2c.ops);

  ESP_LOGI(s_TAG,
           "Created I2C config '%s' (Port: %d, Addr: 0x%02X, SDA: %d, SCL: %d, Speed: %" PRIu32
           " Hz)",
           name,
           port,
           address,
           sda_pin,
           scl_pin,
           clk_speed);
  return config;
}

star_bus_config_t* star_bus_config_create_spi_device(const char*                          name,
                                                     spi_host_device_t                    host,
                                                     gpio_num_t                           copi_pin,
                                                     gpio_num_t                           cipo_pin,
                                                     gpio_num_t                           sclk_pin,
                                                     int32_t                              dma_chan,
                                                     const spi_device_interface_config_t* dev_cfg)
{
  ESP_RETURN_ON_FALSE(dev_cfg, NULL, s_TAG, "SPI device config cannot be NULL");
  ESP_RETURN_ON_FALSE(host >= 0 && host < SPI_HOST_MAX,
                      NULL,
                      s_TAG,
                      "Invalid SPI host number: %d",
                      host);

  star_bus_config_t* config = internal_star_bus_config_create_common(name, k_star_bus_type_spi);
  ESP_RETURN_ON_FALSE(config,
                      NULL,
                      s_TAG,
                      "Failed to create common config for %s",
                      name ? name : "NULL");

  /* Configure SPI-specific parameters */
  config->proto.spi.host = host;

  /* Initialize SPI bus configuration structure within the config */
  /* We copy the relevant pin numbers to our internal structure */
  memset(&config->proto.spi.bus_cfg, 0, sizeof(spi_bus_config_t));
  config->proto.spi.copi_io_num   = copi_pin;
  config->proto.spi.cipo_io_num   = cipo_pin;
  config->proto.spi.sclk_io_num   = sclk_pin;
  config->proto.spi.quadwp_io_num = -1; /* Not used for standard SPI, only QuadSPI */
  config->proto.spi.quadhd_io_num = -1;
  config->proto.spi.max_transfer_sz =
    0; /* 0 means use default (usually 4092 bytes if DMA enabled, 64 otherwise) */

  /* Copy the provided device configuration */
  memcpy(&config->proto.spi.dev_cfg, dev_cfg, sizeof(spi_device_interface_config_t));

  /* Store DMA channel request */
  config->proto.spi.bus_cfg.flags = (dma_chan > 0) ? SPICOMMON_BUSFLAG_MASTER : 0;
  /* The actual DMA channel assignment happens in spi_bus_initialize */

  /* Mark as controller mode (not peripheral) */
  config->proto.spi.is_peripheral = false;

  /* Initialize default operations */
  star_bus_spi_init_default_ops(&config->proto.spi.ops);

  ESP_LOGI(
    s_TAG,
    "Created SPI config '%s' (Host: %d, COPI: %d, CIPO: %d, SCLK: %d, CS: %d, Mode: %d, Speed: %" PRId32
    " Hz, DMA: %s)",
    name,
    host,
    copi_pin,
    cipo_pin,
    sclk_pin,
    dev_cfg->spics_io_num,
    dev_cfg->mode,
    (long)dev_cfg->clock_speed_hz,
    (dma_chan > 0) ? "Enabled" : "Disabled");

  return config;
}

star_bus_config_t* star_bus_config_create_spi_peripheral(const char*       name,
                                                         spi_host_device_t host,
                                                         gpio_num_t        copi_pin,
                                                         gpio_num_t        cipo_pin,
                                                         gpio_num_t        sclk_pin,
                                                         gpio_num_t        cs_pin,
                                                         int32_t           queue_size,
                                                         uint8_t           mode)
{
  ESP_RETURN_ON_FALSE(host >= 0 && host < SPI_HOST_MAX,
                      NULL,
                      s_TAG,
                      "Invalid SPI host number: %d",
                      host);
  ESP_RETURN_ON_FALSE(queue_size > 0 && queue_size <= 10,
                      NULL,
                      s_TAG,
                      "Invalid queue size: %d (must be 1-10)",
                      queue_size);
  ESP_RETURN_ON_FALSE(mode <= 3, NULL, s_TAG, "Invalid SPI mode: %d (must be 0-3)", mode);

  star_bus_config_t* config = internal_star_bus_config_create_common(name, k_star_bus_type_spi);
  ESP_RETURN_ON_FALSE(config,
                      NULL,
                      s_TAG,
                      "Failed to create common config for %s",
                      name ? name : "NULL");

  /* Configure SPI peripheral-specific parameters */
  config->proto.spi.host          = host;
  config->proto.spi.is_peripheral = true; /* Mark as peripheral mode */

  /* Store pin numbers */
  config->proto.spi.copi_io_num   = copi_pin;
  config->proto.spi.cipo_io_num   = cipo_pin;
  config->proto.spi.sclk_io_num   = sclk_pin;
  config->proto.spi.cs_io_num     = cs_pin;
  config->proto.spi.quadwp_io_num = -1;
  config->proto.spi.quadhd_io_num = -1;

