Locked-Inc/STAR/star-esp32-firmware/lib/star_bus/src/star_bus_config.c
  /* Store peripheral-specific parameters */
  config->proto.spi.queue_size = queue_size;
  config->proto.spi.mode       = mode;

  /* Initialize default peripheral operations */
  star_bus_spi_peripheral_init_default_ops(&config->proto.spi.ops);

  ESP_LOGI(
    s_TAG,
    "Created SPI Peripheral config '%s' (Host: %d, COPI: %d, CIPO: %d, SCLK: %d, CS: %d, Mode: %d, Queue: %d)",
    name,
    host,
    copi_pin,
    cipo_pin,
    sclk_pin,
    cs_pin,
    mode,
    queue_size);

  return config;
}

star_bus_config_t*
star_bus_config_create_gpio(const char* name, gpio_num_t* pins, uint8_t pin_count)
{
  ESP_RETURN_ON_FALSE(pins, NULL, s_TAG, "Pin array is NULL");
  ESP_RETURN_ON_FALSE(pin_count > 0, NULL, s_TAG, "Pin count must be > 0");

  star_bus_config_t* config =
    internal_star_bus_config_create_common(name, k_star_bus_type_gpio);
  ESP_RETURN_ON_FALSE(config,
                      NULL,
                      s_TAG,
                      "Failed to create common config for %s",
                      name ? name : "NULL");

  /* Configure GPIO-specific parameters */
  config->proto.gpio.pins      = pins;
  config->proto.gpio.pin_count = pin_count;
  config->proto.gpio.isr_installed = false;

  /* Initialize default GPIO operations */
  config->proto.gpio.ops = star_bus_gpio_get_default_ops();

  ESP_LOGI(s_TAG,
           "Created GPIO config '%s' with %d pins",
           name,
           pin_count);

  return config;
}

star_bus_config_t* star_bus_config_create_adc(const char*    name,
                                               adc_unit_t     unit,
                                               adc_channel_t  channel,
                                               adc_bitwidth_t bitwidth,
                                               adc_atten_t    atten)
{
  star_bus_config_t* config = internal_star_bus_config_create_common(name, k_star_bus_type_adc);
  ESP_RETURN_ON_FALSE(config,
                      NULL,
                      s_TAG,
                      "Failed to create common config for %s",
                      name ? name : "NULL");

  /* Configure ADC-specific parameters */
  config->proto.adc.unit_handle = NULL; /* Will be initialized in star_bus_config_init */
  config->proto.adc.cali_handle = NULL; /* Will be initialized in star_bus_config_init */
  config->proto.adc.unit        = unit; /* Store unit for reference counting */
  config->proto.adc.channel     = channel;
  config->proto.adc.bitwidth    = bitwidth;
  config->proto.adc.atten       = atten;

  /* Initialize default ADC operations */
  config->proto.adc.ops = star_bus_adc_get_default_ops();

  ESP_LOGI(s_TAG,
           "Created ADC config '%s' (Unit: %d, Channel: %d, Bitwidth: %d, Atten: %d)",
           name,
           unit,
           channel,
           bitwidth,
           atten);

  /* Store unit in handle temporarily - will be used during init */
  config->handle = (void*)(intptr_t)unit;

  return config;
}

star_bus_config_t* star_bus_config_create_onewire(const char* name,
                                                   gpio_num_t  gpio_pin,
                                                   bool        use_parasitic_power)
{
  star_bus_config_t* config =
    internal_star_bus_config_create_common(name, k_star_bus_type_onewire);
  ESP_RETURN_ON_FALSE(config,
                      NULL,
                      s_TAG,
                      "Failed to create common config for %s",
                      name ? name : "NULL");

  /* Configure OneWire-specific parameters */
  config->proto.onewire.gpio_pin            = gpio_pin;
  config->proto.onewire.use_parasitic_power = use_parasitic_power;
  config->proto.onewire.use_strong_pullup   = use_parasitic_power;
  config->proto.onewire.speed               = 0; /* 0 = standard speed */
  config->proto.onewire.search_timeout_ms   = 5000;

  /* Initialize default operations to NULL - OneWire uses direct API */
  memset(&config->proto.onewire.ops, 0, sizeof(star_onewire_ops_t));

  ESP_LOGI(s_TAG,
           "Created OneWire config '%s' (Pin: %d, Parasitic: %s)",
           name,
           gpio_pin,
           use_parasitic_power ? "Yes" : "No");

  return config;
}

esp_err_t star_bus_config_destroy(star_bus_config_t* config)
{
  ESP_RETURN_ON_FALSE(config, ESP_ERR_INVALID_ARG, s_TAG, "Config pointer is NULL");

  /* If the bus/device is initialized, deinitialize it first */
  if (config->initialized) {
    esp_err_t ret = star_bus_config_deinit(config);
    if (ret != ESP_OK) {
      ESP_LOGE(s_TAG,
               "Failed to deinitialize bus '%s' before destroying: %s. Continuing cleanup.",
               config->name ? config->name : "UNKNOWN",
               esp_err_to_name(ret));
      /* Continue cleanup even if deinit failed to avoid memory leaks */
    }
  }

  ESP_LOGI(s_TAG, "Destroying bus config '%s'", config->name ? config->name : "UNKNOWN");

  /* Specific cleanup for SPI is handled by the manager during remove_bus */
  /* The manager checks if the bus needs to be freed based on device count */

  /* Clean up and free the configuration */
  internal_star_bus_config_cleanup(config);

  /* IMPORTANT: After this call, the config pointer is invalid. */
  return ESP_OK;
}

/**
 * @brief Initialize the bus/device associated with this configuration.
 *
 * For I2C: Performs i2c_param_config, i2c_driver_install.
 * For SPI: Performs spi_bus_initialize (if not already done for this host) and spi_bus_add_device.
 *          Requires the bus manager to track host initialization status.
 *
 * @param[in] config Pointer to the bus configuration to initialize.
 * @param[in] manager Pointer to the bus manager (needed for SPI host tracking).
 * @return esp_err_t ESP_OK on success, ESP_ERR_INVALID_ARG if config or manager is NULL, ESP_ERR_INVALID_STATE if already initialized, or an error code from the underlying driver initialization.
 */
esp_err_t star_bus_config_init(star_bus_config_t* config, star_bus_manager_t* manager)
{
  ESP_RETURN_ON_FALSE(config, ESP_ERR_INVALID_ARG, s_TAG, "Config pointer is NULL");
  ESP_RETURN_ON_FALSE(!config->initialized,
                      ESP_ERR_INVALID_STATE,
                      s_TAG,
                      "Bus '%s' is already initialized",
                      config->name ? config->name : "UNKNOWN");

