Locked-Inc/STAR/star-esp32-firmware/lib/star_bus/src/star_bus_config.c
  esp_err_t   ret      = ESP_OK;
  const char* bus_name = config->name ? config->name : "UNKNOWN"; /* Use for logging */

  switch (config->type) {
    case k_star_bus_type_i2c:
      /* Initialize I2C bus */
      ESP_LOGI(s_TAG, "Initializing I2C bus '%s' (Port %d)", bus_name, config->proto.i2c.port);

      ret = i2c_param_config(config->proto.i2c.port, &config->proto.i2c.config);
      ESP_GOTO_ON_ERROR(ret,
                        fail,
                        s_TAG,
                        "i2c_param_config failed for '%s': %s",
                        bus_name,
                        esp_err_to_name(ret));

      ret = i2c_driver_install(config->proto.i2c.port,
                               config->proto.i2c.config.mode,
                               0,  /* RX buffer size (controller mode) */
                               0,  /* TX buffer size (controller mode) */
                               0); /* Flags */
      ESP_GOTO_ON_ERROR(ret,
                        fail_i2c_driver,
                        s_TAG,
                        "i2c_driver_install failed for '%s': %s",
                        bus_name,
                        esp_err_to_name(ret));
      break;

    case k_star_bus_type_spi:
      ESP_RETURN_ON_FALSE(manager,
                          ESP_ERR_INVALID_ARG,
                          s_TAG,
                          "Bus manager pointer is required for SPI initialization");

      spi_host_device_t host = config->proto.spi.host;
      ESP_RETURN_ON_FALSE(host >= 0 && host < SPI_HOST_MAX,
                          ESP_ERR_INVALID_ARG,
                          s_TAG,
                          "Invalid SPI host number: %d",
                          host);

      /* Check if this is peripheral or controller mode */
      if (config->proto.spi.is_peripheral) {
        /* SPI Peripheral Mode */
        ESP_LOGI(s_TAG, "Initializing SPI peripheral '%s' (Host %d)", bus_name, host);

        spi_slave_interface_config_t slave_cfg = {
          .spics_io_num  = config->proto.spi.cs_io_num,
          .flags         = 0,
          .queue_size    = config->proto.spi.queue_size,
          .mode          = config->proto.spi.mode,
          .post_setup_cb = NULL,
          .post_trans_cb = NULL,
        };

        /* Map COPI/CIPO to ESP-IDF's MOSI/MISO */
        spi_bus_config_t bus_cfg = {
          .mosi_io_num     = config->proto.spi.copi_io_num,
          .miso_io_num     = config->proto.spi.cipo_io_num,
          .sclk_io_num     = config->proto.spi.sclk_io_num,
          .quadwp_io_num   = -1,
          .quadhd_io_num   = -1,
          .max_transfer_sz = 0,
        };

        /* DMA for SPI peripheral is controlled by the DMA channel parameter */
#if CONFIG_IDF_TARGET_ESP32S3
        /* ESP32-S3: Enable DMA for better performance (95% CPU reduction) */
        int dma_chan = SPI_DMA_CH_AUTO;
#else
        /* ESP32-WROOM: No DMA support for SPI peripheral */
        int dma_chan = SPI_DMA_DISABLED;
#endif

        ret = spi_slave_initialize(host, &bus_cfg, &slave_cfg, dma_chan);
        ESP_GOTO_ON_ERROR(ret,
                          fail,
                          s_TAG,
                          "spi_slave_initialize failed for '%s': %s",
                          bus_name,
                          esp_err_to_name(ret));

        manager->spi_host_initialized[host] = true;
        ESP_LOGI(s_TAG, "SPI peripheral '%s' initialized successfully", bus_name);
      } else {
        /* SPI Controller Mode */
        ESP_LOGI(s_TAG, "Initializing SPI device '%s' (Host %d)", bus_name, host);

        /* Initialize the SPI bus *only if* it hasn't been initialized yet for this host */
        if (!manager->spi_host_initialized[host]) {
          ESP_LOGI(s_TAG, "Initializing SPI bus driver for host %d...", host);
          /* Map COPI/CIPO to ESP-IDF's MOSI/MISO */
          spi_bus_config_t esp_idf_bus_cfg = {
            .mosi_io_num     = config->proto.spi.copi_io_num,
            .miso_io_num     = config->proto.spi.cipo_io_num,
            .sclk_io_num     = config->proto.spi.sclk_io_num,
            .quadwp_io_num   = config->proto.spi.quadwp_io_num,
            .quadhd_io_num   = config->proto.spi.quadhd_io_num,
            .max_transfer_sz = config->proto.spi.max_transfer_sz,
            .flags           = config->proto.spi.bus_cfg.flags,
          };
          int32_t dma_chan = (config->proto.spi.bus_cfg.flags & SPICOMMON_BUSFLAG_MASTER)
                               ? SPI_DMA_CH_AUTO
                               : SPI_DMA_DISABLED;
          ret              = spi_bus_initialize(host, &esp_idf_bus_cfg, dma_chan);
          ESP_GOTO_ON_ERROR(ret,
                            fail,
                            s_TAG,
                            "spi_bus_initialize failed for host %d: %s",
                            host,
                            esp_err_to_name(ret));
          manager->spi_host_initialized[host] = true;
          manager->spi_device_count[host]     = 0;
          ESP_LOGI(s_TAG, "SPI bus driver for host %d initialized.", host);
        } else {
          ESP_LOGD(s_TAG, "SPI bus driver for host %d already initialized.", host);
        }

        /* Add the SPI device to the bus */
        spi_device_handle_t spi_handle;
        ret = spi_bus_add_device(host, &config->proto.spi.dev_cfg, &spi_handle);
        ESP_GOTO_ON_ERROR(ret,
                          fail_spi_add_device,
                          s_TAG,
                          "spi_bus_add_device failed for '%s': %s",
                          bus_name,
                          esp_err_to_name(ret));
        config->handle = (void*)spi_handle;
        manager->spi_device_count[host]++;
      }
      break;

    case k_star_bus_type_gpio: {
      /* Initialize GPIO pins */
      ESP_LOGI(s_TAG, "Initializing GPIO bus '%s' with %d pins", bus_name, config->proto.gpio.pin_count);

      for (uint8_t i = 0; i < config->proto.gpio.pin_count; i++) {
        gpio_num_t pin = config->proto.gpio.pins[i];

        /* Configure each pin as output with default low level */
        gpio_config_t io_conf = {
          .pin_bit_mask = (1ULL << pin),
          .mode         = GPIO_MODE_INPUT_OUTPUT, /* Allow both input and output */
          .pull_up_en   = GPIO_PULLUP_DISABLE,
          .pull_down_en = GPIO_PULLDOWN_DISABLE,
          .intr_type    = GPIO_INTR_DISABLE,
        };

        ret = gpio_config(&io_conf);
        ESP_GOTO_ON_ERROR(ret,
                          fail,
                          s_TAG,
                          "gpio_config failed for pin %d: %s",
                          pin,
                          esp_err_to_name(ret));
      }

