Locked-Inc/STAR/star-esp32-firmware/lib/star_bus/src/star_bus_config.c
      ESP_LOGI(s_TAG, "GPIO bus '%s' initialized successfully", bus_name);
      break;
    }

    case k_star_bus_type_adc: {
      /* Initialize ADC unit */
      ESP_RETURN_ON_FALSE(manager,
                          ESP_ERR_INVALID_ARG,
                          s_TAG,
                          "Bus manager pointer is required for ADC initialization");

      adc_unit_t unit = config->proto.adc.unit;
      ESP_LOGI(s_TAG,
               "Initializing ADC bus '%s' (Unit: %d, Channel: %d)",
               bus_name,
               unit,
               config->proto.adc.channel);

      /* Check if ADC unit is already initialized (shared across channels) */
      if (manager->adc_unit_handles[unit] == NULL) {
        /* First channel on this unit - create the unit handle */
        ESP_LOGI(s_TAG, "Creating new ADC unit handle for unit %d", unit);

        adc_oneshot_unit_init_cfg_t unit_cfg = {
          .unit_id  = unit,
          .ulp_mode = ADC_ULP_MODE_DISABLE,
        };

        ret = adc_oneshot_new_unit(&unit_cfg, &manager->adc_unit_handles[unit]);
        ESP_GOTO_ON_ERROR(ret,
                          fail,
                          s_TAG,
                          "adc_oneshot_new_unit failed for '%s': %s",
                          bus_name,
                          esp_err_to_name(ret));
      } else {
        /* Unit already initialized - reuse the handle */
        ESP_LOGI(s_TAG, "Reusing existing ADC unit handle for unit %d", unit);
      }

      /* Store the shared unit handle in this config */
      config->proto.adc.unit_handle = manager->adc_unit_handles[unit];

      /* Configure this specific ADC channel */
      adc_oneshot_chan_cfg_t chan_cfg = {
        .bitwidth = config->proto.adc.bitwidth,
        .atten    = config->proto.adc.atten,
      };

      ret = adc_oneshot_config_channel(config->proto.adc.unit_handle,
                                        config->proto.adc.channel,
                                        &chan_cfg);
      ESP_GOTO_ON_ERROR(ret,
                        fail_adc_unit,
                        s_TAG,
                        "adc_oneshot_config_channel failed for '%s': %s",
                        bus_name,
                        esp_err_to_name(ret));

      /* Increment channel count for this unit */
      manager->adc_channel_count[unit]++;

      /* Try to initialize calibration (optional, may fail on some chips) */
#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
      adc_cali_curve_fitting_config_t cali_cfg = {
        .unit_id  = unit,
        .chan     = config->proto.adc.channel,
        .atten    = config->proto.adc.atten,
        .bitwidth = config->proto.adc.bitwidth,
      };

      ret = adc_cali_create_scheme_curve_fitting(&cali_cfg, &config->proto.adc.cali_handle);
      if (ret == ESP_OK) {
        ESP_LOGI(s_TAG, "ADC calibration (curve fitting) initialized for '%s'", bus_name);
      } else {
        ESP_LOGW(s_TAG,
                 "ADC calibration initialization failed for '%s': %s (continuing without "
                 "calibration)",
                 bus_name,
                 esp_err_to_name(ret));
        config->proto.adc.cali_handle = NULL;
      }
#elif ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
      adc_cali_line_fitting_config_t cali_cfg = {
        .unit_id  = unit,
        .atten    = config->proto.adc.atten,
        .bitwidth = config->proto.adc.bitwidth,
      };

      ret = adc_cali_create_scheme_line_fitting(&cali_cfg, &config->proto.adc.cali_handle);
      if (ret == ESP_OK) {
        ESP_LOGI(s_TAG, "ADC calibration (line fitting) initialized for '%s'", bus_name);
      } else {
        ESP_LOGW(s_TAG,
                 "ADC calibration initialization failed for '%s': %s (continuing without "
                 "calibration)",
                 bus_name,
                 esp_err_to_name(ret));
        config->proto.adc.cali_handle = NULL;
      }
#else
      ESP_LOGW(s_TAG, "ADC calibration not supported on this chip, continuing without calibration");
      config->proto.adc.cali_handle = NULL;
#endif

      ESP_LOGI(s_TAG, "ADC bus '%s' initialized successfully", bus_name);
      break;

    fail_adc_unit:
      /* Only delete the unit if we created it (first channel on this unit) */
      manager->adc_channel_count[unit]--;
      if (manager->adc_channel_count[unit] == 0 && manager->adc_unit_handles[unit]) {
        adc_oneshot_del_unit(manager->adc_unit_handles[unit]);
        manager->adc_unit_handles[unit] = NULL;
      }
      config->proto.adc.unit_handle = NULL;
      goto fail;
    }

    case k_star_bus_type_onewire: {
      /* Initialize OneWire bus */
      ESP_RETURN_ON_FALSE(manager,
                          ESP_ERR_INVALID_ARG,
                          s_TAG,
                          "Bus manager pointer is required for OneWire initialization");

      ESP_LOGI(s_TAG,
               "Initializing OneWire bus '%s' (Pin: %d)",
               bus_name,
               config->proto.onewire.gpio_pin);

      /* Create onewire config and call star_bus_onewire_init() */
      star_onewire_config_t ow_cfg;
      ow_cfg.gpio_pin            = config->proto.onewire.gpio_pin;
      ow_cfg.speed               = (star_onewire_speed_t)config->proto.onewire.speed;
      ow_cfg.use_parasitic_power = config->proto.onewire.use_parasitic_power;
      ow_cfg.use_strong_pullup   = config->proto.onewire.use_strong_pullup;
      ow_cfg.search_timeout_ms   = config->proto.onewire.search_timeout_ms;

      ret = star_bus_onewire_init(manager, config->name, &ow_cfg);
      ESP_GOTO_ON_ERROR(ret,
                        fail,
                        s_TAG,
                        "star_bus_onewire_init failed for '%s': %s",
                        bus_name,
                        esp_err_to_name(ret));

      ESP_LOGI(s_TAG, "OneWire bus '%s' initialized successfully", bus_name);
      break;
    }

    default:
      ESP_LOGE(s_TAG, "Unsupported bus type for initialization: %d", config->type);
      ret = ESP_ERR_NOT_SUPPORTED;
      goto fail;
  }

